from userbot import iqthon

from ..core.managers import edit_or_reply

plugin_category = "الأوامر"



@iqthon.iq_cmd(
    pattern="م22$",
    command=("م22", plugin_category),
    info={
        "header": "م22",
        "usage": "م22",
    },
)
async def _(event):
    "م22"
    await edit_or_reply(
        event,
        "- 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⌔︙ قائـمه اوامر الزغرفه :** \n⌔︙ `.زغرفه ` \n⌔︙ `.اسماء تمبلر `    \n⌔︙ `.اسماء عربيه` \n⌔︙ `.المواليد ` \n⌔︙ `.اشهر مزغرفه` \n⌔︙ `.الاختصارات` \n⌔︙ `.البايو` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n - [𝐒𝐎𝐔𝐑𝐂𝐄](t.me/iqthon)",

    )
@iqthon.iq_cmd(
    pattern="زغرفه$",
    command=("زغرفه", plugin_category),
    info={
        "header": "زغرفه",
        "usage": "زغرفه",
    },
)
async def _(event):
    "م22"
    await edit_or_reply(
        event,
        "𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
                "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
                "**⌔︙ قائـمه اوامر الزغرفه :**\n"
                "⌔︙ `.زغرفه1`\n"
                "⌔︙ `.زغرفه2`\n"
                "⌔︙ `.زغرفه3`\n"
                "⌔︙ `.زغرفه4`\n"
                "⌔︙ `.زغرفه5`\n"
                "⌔︙ `.زغرفه6`\n"
                "⌔︙ `.زغرفه7`\n"
                "⌔︙ `.زغرفه8`\n"
                "⌔︙ `.زغرفه9`\n"
                "⌔︙ `.زغرفه10`\n"
                "⌔︙ `.زغرفه11`\n"
                "⌔︙ `.زغرفه12`\n"
                "⌔︙ `.زغرفه13`\n"
                "⌔︙ `.زغرفه14`\n"
                "⌔︙ `.زغرفه15`\n"
                "⌔︙ `.زغرفه16`\n"
                "⌔︙ **زغرفه انكلش فقط**\n"
                "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
                " - [𝐒𝐎𝐔𝐑𝐂𝐄](t.me/iqthon) 𓆪"

    )

@iqthon.iq_cmd(
    pattern="اسماء تمبلر$",
    command=("اسماء تمبلر", plugin_category),
    info={
        "header": "اسماء تمبلر",
        "usage": "اسماء تمبلر",
    },
)
async def _(event):
    "اسماء تمبلر"
    await edit_or_reply(
        event,
                "- 𝑻𝑼𝑴 𝑵𝑨𝑴𝑬𝑺 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⌔︙ قائـمه اسماء التمبلر :** \n⌔︙ `.شباب ` \n⌔︙ `.شباب2` \n⌔︙ `.بنات ` \n⌔︙ `.بنات2 ` \n⌔︙ `.قنوات` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n - [𝐒𝐎𝐔𝐑𝐂𝐄](t.me/iqthon)"

    )
@iqthon.iq_cmd(
    pattern="البايو$",
    command=("البايو", plugin_category),
    info={
        "header": "البايو",
        "usage": "البايو",
    },
)
async def _(event):
    "م22"
    await edit_or_reply(
        event,
                "- 𝑩𝑰𝑶 𝑳𝑰𝑺𝑻 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⌔︙ قائـمه البايو :** \n⌔︙ `.بايو1 ` \n⌔︙ `.بايو2` \n⌔︙ `.بايو3 ` \n⌔︙ `.بايو4 ` \n⌔︙ `.بايو5` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n - [𝐒𝐎𝐔𝐑𝐂𝐄](t.me/iqthon)"
            )
@iqthon.iq_cmd(
    pattern="الاختصارات$",
    command=("الاختصارات", plugin_category),
    info={
        "header": "الاختصارات",
        "usage": "الاختصارات",
    },
)
async def _(event):
    "الاختصارات"
    await edit_or_reply(
        event,
                "- 𝑺𝑯𝑶𝑹𝑻𝑪𝑼𝑻𝑺 𓆪\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⌔︙ قائـمه الاختصارات :** \n⌔︙ `.اختصارات1 ` \n⌔︙ `.اختصارات2` \n⌔︙ `.اختصارات3 ` \n⌔︙ `.اختصارات4 ` \n⌔︙ `.اختصارات5` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n - [𝐒𝐎𝐔𝐑𝐂𝐄](t.me/iqthon)"
            )
